[
  {
    "Id": "291e236a-b6ad-4ae9-a37e-434383e16e8c",
    "Ingredients": [
      "70ml rapeseed oil",
      "1 tsp cider vinegar",
      "200ml plant milk (we used oat)",
      "225g self-raising flour",
      "1 tsp baking powder",
      "150g golden caster sugar",
      "2 tsp vanilla paste",
      "200g vegan plant butter block, softened",
      "2 tsp vanilla paste",
      "400g icing sugar"
    ],
    "Title": "Vegan vanilla icecream",
    "Instructions": [
      "Combine the rapeseed oil, cider vinegar and oat milk in a jug. Heat the oven to 180C/160C fan/gas 4. Line a 12-hole cupcake or muffin tray with paper cases. Tip the flour, baking powder and sugar into a large bowl. Make a well in the middle and slowly pour in the wet mixture, whisking constantly. Add the vanilla paste and stir to combine. Divide evenly between the paper cases and bake for 15-20 mins until golden and a skewer inserted into the middle of a cupcake comes out clean. Transfer to a cooling rack to cool completely.",
      "For the icing, beat the plant block and vanilla until soft and creamy, around 2 mins. Add the icing sugar in batches, beating well after each addition, and a large pinch of salt. Transfer to a piping bag fitted with a star nozzle. Pipe swirls on top of each cooled cupcake. Will keep, iced, for up to three days in an airtight container."
    ],
    "Categories": [
      "Desserts"
    ]
  },
  {
    "Id": "e099ec4e-c01a-46fd-8cdf-f0741da6cdfb",
    "Ingredients": [
      "1 1/2 tbsp fresh lime juice",
      "1 garlic clove, crushed",
      "1 tbsp finely chopped palm sugar",
      "1 tbsp fish sauce",
      "2 tsp sesame oil",
      "1 tsp soy sauce",
      "2 tsp finely grated fresh ginger",
      "1 (about 680g) beef rump steak",
      "1 x 200g pkt grape tomatoes, quartered",
      "1 continental cucumber, halved lengthways, thinly sliced diagonally",
      "1 red onion, halved, cut into thin wedges",
      "2 long fresh red chilies, halved, deseeded, thinly sliced lengthways",
      "1 bunch fresh mint, leaves picked, large leaves torn",
      "1 bunch fresh coriander, leaves picked",
      "1 bunch fresh Thai basil, leaves picked, large leaves torn",
      "55g (1/3 cup) toasted peanuts, coarsely chopped",
      "4 kaffir lime leaves, center veins removed, finely shredded"
    ],
    "Title": "Thai beef salad",
    "Instructions": [
      "Whisk together lime juice , garlic , fish sauce , sesame oil , soy sauce , ginger and palm sugar in a jug. Place the steak in a glass or ceramic dish. Drizzle with half the dressing. Cover with plastic wrap and place in the fridge, turning occasionally, for 2 hours to develop the flavors.",
      "Preheat a barbecue grill or chargrill pan on high. Cook steak on grill for 23 minutes each side for medium or until cooked to your liking. Transfer to a plate. Cover with foil and set aside for 10 minutes to rest.",
      "Place the tomato , cucumber , onion , chili , mint , coriander , basil , peanuts and lime leaves in a large bowl. Thinly slice steak across the grain and add to the salad. Drizzle with remaining dressing and gently toss to combine. Divide salad among bowls and serve immediately."
    ],
    "Categories": [
      "Appetizer",
      "Dinner"
    ]
  }
]